Revit 2027 API
BuiltInFailures.ImportFailures.IFCPartialSchemaSupport Property
 IFC versions 4 and above are only partially supported by Open IFC. Consider using Link IFC instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IFCPartialSchemaSupport { get; }
Public Shared ReadOnly Property IFCPartialSchemaSupport As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IFCPartialSchemaSupport {
	FailureDefinitionId^ get ();
}
static member IFCPartialSchemaSupport : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace